Pandas allows us to treat data in a table-like way (think excel) and to utilize a structure called a Data Frame. These methods make it much easier to manipulate and slice data. No more excessive loops and list comprehensions.

In [2]:
#import [something] as [new name]
import pandas as pd

In [3]:
#pulling from internet
#users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',  sep='|', index_col='user_id')

In [4]:
pwd

u'/Users/octaviapayne/Desktop/ga_hw'

In [5]:
#can also pull locally
users = pd.read_table('../DAT-DC-10/data/u.user', sep='|', index_col="user_id")

In [6]:
users.head(5)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [7]:
type(users) # Date Frame - pandas is all about this type of object

pandas.core.frame.DataFrame

In [8]:
users.head(5)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [9]:
users.columns

Index([u'age', u'gender', u'occupation', u'zip_code'], dtype='object')

In [10]:
users.index # The "index" or the row labels

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name=u'user_id', length=943)

In [11]:
users.shape
#returns (rows, columns)

(943, 4)

In [12]:
users.values # so there's an underlying "array" data type, and the Data Frame object encapsulates it, and adds more functionality

array([[24, 'M', 'technician', '85711'],
       [53, 'F', 'other', '94043'],
       [23, 'M', 'writer', '32067'],
       ...,
       [20, 'M', 'student', '97229'],
       [48, 'F', 'librarian', '78209'],
       [22, 'M', 'student', '77841']], dtype=object)

With a Data Frame, we have columns with names, so we can select on those columns.

In [14]:
# select a column
users['gender']         # select one column
users.gender.head(5)            # or with dot notation

user_id
1    M
2    F
3    M
4    M
5    F
Name: gender, dtype: object

In [15]:
type(users.gender) # a Series is a basic data type in pandas

pandas.core.series.Series

Data Frames have many built-in functions for things we might commonly want. For example, if we want a statistical summary of the numeric columns.

In [16]:
# summarize (describe) the DataFrame
users.describe()                    # describe all numeric columns

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [17]:
# or a statistical summary of all columns
users.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

For any column, we can access useful statistical summaries.

In [18]:
users.age.mean()

34.05196182396607

In [19]:
users.gender.value_counts()

M    670
F    273
Name: gender, dtype: int64

** Exercise** 

1. Read drinks.csv into a DataFrame called 'drinks'
2. Print the head and the tail 
3. Examine the default index, data types, and shape
4. Print the 'beer_servings' Series
5. Calculate the mean 'beer_servings' for the entire dataset
6. Count the number of occurrences of each 'continent' value
7. **Bonus** Display only the number of rows of the 'users' DataFrame
8. **Bonus** Display the 3 most frequent occupations in 'users'

In [20]:
import pandas as pd
drinks = pd.read_table('../DAT-DC-10/data/drinks.csv', sep=',', index_col="country")

print drinks.head()
print drinks.tail()

             beer_servings  spirit_servings  wine_servings  \
country
Afghanistan              0                0              0
Albania                 89              132             54
Algeria                 25                0             14
Andorra                245              138            312
Angola                 217               57             45

             total_litres_of_pure_alcohol continent
country
Afghanistan                           0.0        AS
Albania                               4.9        EU
Algeria                               0.7        AF
Andorra                              12.4        EU
Angola                                5.9        AF
           beer_servings  spirit_servings  wine_servings  \
country
Venezuela            333              100              3
Vietnam              111                2              1
Yemen                  6                0              0
Zambia                32               19              4
Zimbabwe              64               18              4

           total_litres_of_pure_alcohol continent
country
Venezuela                           7.7        SA
Vietnam                             2.0        AS
Yemen                               0.1        AS
Zambia                              2.5        AF
Zimbabwe                            4.7        AF

In [21]:
drinks.index

Index([u'Afghanistan', u'Albania', u'Algeria', u'Andorra', u'Angola',
       u'Antigua & Barbuda', u'Argentina', u'Armenia', u'Australia',
       u'Austria',
       ...
       u'Tanzania', u'USA', u'Uruguay', u'Uzbekistan', u'Vanuatu',
       u'Venezuela', u'Vietnam', u'Yemen', u'Zambia', u'Zimbabwe'],
      dtype='object', name=u'country', length=193)

In [22]:
type(drinks)

pandas.core.frame.DataFrame

In [23]:
drinks.shape

(193, 5)

In [24]:
drinks.beer_servings.mean()

106.16062176165804

In [25]:
drinks.continent.value_counts()

AF    53
EU    45
AS    44
OC    16
SA    12
Name: continent, dtype: int64

In [26]:
drinks.describe(include='all')

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
count,193.000000,193.000000,193.000000,193.000000,170
unique,NaN,NaN,NaN,NaN,5
top,NaN,NaN,NaN,NaN,AF
freq,NaN,NaN,NaN,NaN,53
mean,106.160622,80.994819,49.450777,4.717098,NaN
std,101.143103,88.284312,79.697598,3.773298,NaN
min,0.000000,0.000000,0.000000,0.000000,NaN
25%,20.000000,4.000000,1.000000,1.300000,NaN
50%,76.000000,56.000000,8.000000,4.200000,NaN
75%,188.000000,128.000000,59.000000,7.200000,NaN
max,376.000000,438.000000,370.000000,14.400000,NaN

In [27]:
users.occupation.value_counts().head(3)
users.occupation.value_counts()[:3]

student     196
other       105
educator     95
Name: occupation, dtype: int64

Pandas provides easy functionality for a variety of filtering and sorting tasks we inevitably encounter. Again, this kind of work could be done with loops and conditionals, but the Data Frame methods make things much easier.

For example, we can filter on a boolean expression:

In [28]:
#  boolean filtering: only show users with age < 20
young_bool = users.age < 20         # create a Series of booleans...
users[young_bool]                   # ...and use that Series to filter rows
users[users.age < 20]               # or, combine into a single step #and = & or = |
users[users.age < 20]
users[users.age < 20].occupation    # select one column from the filtered results
users[users.age < 20].occupation.value_counts()     # value_counts of resulting Series

student          64
other             4
none              3
writer            2
entertainment     2
salesman          1
artist            1
Name: occupation, dtype: int64

And we can have filtering with multiple conditions:

In [29]:
# boolean filtering with multiple conditions
users[(users.age < 20) & (users.gender=='M')].head(5)       # ampersand for AND condition
users[(users.age < 20) | (users.age > 60)].head(5)          # pipe for OR condition

         age gender occupation zip_code
user_id
30         7      M    student    55436
36        19      F    student    93117
52        18      F    student    55105
57        16      M       none    84010
67        17      M    student    60402

And we can sort by various columns:

In [30]:
# sorting
users.age.sort_values().head(5)                   # sort a column
users.sort_values('age').head(5)                   # sort a DataFrame by a single column
users.sort_values('age', ascending=False).head(5)  # use descending order instead

         age gender     occupation zip_code
user_id
481       73      M        retired    37771
803       70      M  administrator    78212
767       70      M       engineer    00000
860       70      F        retired    48322
585       69      M      librarian    98501

** Exercise** 

1. Filter 'drinks' to only include European countries
2. Filter 'drinks' to only include European countries with wine_servings > 300
3. Calculate the mean 'beer_servings' for all of Europe
4. Determine which 10 countries have the highest total_litres_of_pure_alcohol
5. **Bonus** Sort 'users' by 'occupation' and then by 'age' (in a single command)

In [32]:
drinks[drinks.continent == 'EU'].head(5) # Filter 'drinks' to only include European countries
drinks[(drinks.continent == 'EU') & (drinks.wine_servings > 300)].head(5) # Filter 'drinks' to only include European countries with wine_servings > 300
drinks[drinks.continent == 'EU'].beer_servings.mean() # Calculate the mean 'beer_servings' for all of Europe
drinks.sort_values('total_litres_of_pure_alcohol', ascending=False).head(10) # Determine which 10 countries have the highest total_litres_of_pure_alcohol
users.sort_values(by=['occupation', 'age'], ascending=[False, False]).head(5) # Sort 'users' by 'occupation' and then by 'age' (in a single command)

         age gender occupation zip_code
user_id
464       60      M     writer    94583
558       56      F     writer    63132
370       52      M     writer    08534
392       52      M     writer    59801
548       51      M     writer    95468

We can easily rename columns if needed. And it is easy to remove existing columns or to add new ones.

In [33]:
drinks = pd.read_csv("../DAT-DC-10/data/drinks.csv")
# rename one or more columns
drinks.rename(columns={'beer_servings':'beer', 'wine_servings':'wine'})
drinks.rename(columns={'beer_servings':'beer', 'wine_servings':'wine'}, inplace=True)

In [34]:
# replace all column names
drink_cols = ['country', 'beer', 'spirit', 'wine', 'liters', 'continent']
drinks.columns = drink_cols

In [35]:
# replace all column names when reading the file
drinks = pd.read_csv('../DAT-DC-10/data/drinks.csv', header=0, names=drink_cols)

In [36]:
# add a new column as a function of existing columns
drinks['servings'] = drinks.beer + drinks.spirit + drinks.wine
drinks['mL'] = drinks.liters * 1000
drinks.head(2)

       country  beer  spirit  wine  liters continent  servings    mL
0  Afghanistan     0       0     0     0.0        AS         0     0
1      Albania    89     132    54     4.9        EU       275  4900

In [37]:
drinks['total_milliliters_of_alcohol'] = 1000 * drinks.liters

In [38]:
drinks.head()

,country,beer,spirit,wine,liters,continent,servings,mL,total_milliliters_of_alcohol
0,Afghanistan,0,0,0,0.0,AS,0,0,0
1,Albania,89,132,54,4.9,EU,275,4900,4900
2,Algeria,25,0,14,0.7,AF,39,700,700
3,Andorra,245,138,312,12.4,EU,695,12400,12400
4,Angola,217,57,45,5.9,AF,319,5900,5900

In [39]:
# removing columns
drinks.drop('mL', axis=1)                               # axis=0 for rows, 1 for columns
drinks.drop(['mL', 'servings'], axis=1, inplace=True)   # drop multiple columns

In data analysis, we often encounter missing data and need to think about how to handle this. Many methods will simply ignore missing data, and we just need to make sure we're handling things sensibly.

In [44]:
# missing values are usually excluded by default
drinks.continent.value_counts().head(5)              # excludes missing values
drinks.continent.value_counts(dropna=False).head(5)  # includes missing values

AF     53
EU     45
AS     44
NaN    23
OC     16
Name: continent, dtype: int64

In [45]:
# find missing values in a Series
drinks.continent.isnull().head(5)           # True if missing
drinks.continent.notnull().head(5)          # True if not missing

0    True
1    True
2    True
3    True
4    True
Name: continent, dtype: bool

In [46]:
# use a boolean Series to filter DataFrame rows
drinks[drinks.continent.isnull()].head(5)   # only show rows where continent is missing
drinks[drinks.continent.notnull()].head(5)  # only show rows where continent is not missing

,country,beer,spirit,wine,liters,continent,total_milliliters_of_alcohol
0,Afghanistan,0,0,0,0.0,AS,0
1,Albania,89,132,54,4.9,EU,4900
2,Algeria,25,0,14,0.7,AF,700
3,Andorra,245,138,312,12.4,EU,12400
4,Angola,217,57,45,5.9,AF,5900

In [49]:
# side note: understanding axes
drinks.sum().head(5)            # sums "down" the 0 axis (rows)
drinks.sum(axis=0).head(5)      # equivalent (since axis=0 is the default)
drinks.sum(axis=1).head(5)      # sums "across" the 1 axis (columns)

0        0.0
1     5179.9
2      739.7
3    13107.4
4     6224.9
dtype: float64

In [50]:
# side note: adding booleans
pd.Series([True, False, True])          # create a boolean Series
pd.Series([True, False, True]).sum()    # converts False to 0 and True to 1

2

In [51]:
# find missing values in a DataFrame
drinks.isnull()             # DataFrame of booleans
drinks.isnull().sum()       # count the missing values in each column

country                          0
beer                             0
spirit                           0
wine                             0
liters                           0
continent                       23
total_milliliters_of_alcohol     0
dtype: int64

In [53]:
# drop missing values
drinks.dropna()             # drop a row if ANY values are missing
drinks.dropna(how='all').head(5)    # drop a row only if ALL values are missing

,country,beer,spirit,wine,liters,continent,total_milliliters_of_alcohol
0,Afghanistan,0,0,0,0.0,AS,0
1,Albania,89,132,54,4.9,EU,4900
2,Algeria,25,0,14,0.7,AF,700
3,Andorra,245,138,312,12.4,EU,12400
4,Angola,217,57,45,5.9,AF,5900

In [54]:
# fill in missing values
drinks.continent.fillna(value='NA', inplace=True)   # fill in missing values with 'NA'

In [56]:
# turn off the missing value filter
drinks = pd.read_csv('../DAT-DC-10/data/drinks.csv', header=0, names=drink_cols, na_filter=False)

** Exercise** 

1. Read ufo.csv into a DataFrame called 'ufo'
2. Check the shape of the DataFrame
3. Calculate the most frequent value for each of the columns (in a single command)
4. What are the four most frequent colors reported?
5. For reports in VA, what's the most frequent city?
6. Show only the UFO reports from Arlington, VA
7. Count the number of missing values in each column
8. Show only the UFO reports in which the City is missing
9. How many rows remain if you drop all rows with any missing values?
10. **Bonus** Create a new column called 'Location' that includes both City and State
11. **Bonus** Replace any spaces in the column names with an underscore

In [57]:
# Read ufo.csv into a DataFrame called 'ufo'
import pandas as pd
ufo = pd.read_csv('../DAT-DC-10/data/ufo.csv', delimiter=",")

In [58]:
# Check the shape of the DataFrame
ufo.shape

(80543, 5)

In [59]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [60]:
# Calculate the most frequent value for each of the columns (in a single command)
ufo.describe()

           City Colors Reported Shape Reported  State            Time
count     80496           17034          72141  80543           80543
unique    13504              31             27     52           68901
top     Seattle          ORANGE          LIGHT     CA  7/4/2014 22:00
freq        646            5216          16332  10743              45

In [61]:
# What are the four most frequent colors reported?
ufo['Colors Reported'].value_counts().head(4)

ORANGE    5216
RED       4809
GREEN     1897
BLUE      1855
Name: Colors Reported, dtype: int64

In [62]:
# For reports in VA, what's the most frequent city?
ufo[ufo.State == 'VA'].City.value_counts().head(1)

Virginia Beach    110
Name: City, dtype: int64

In [63]:
# Show only the UFO reports from Arlington, VA
ufo[(ufo.State == 'VA') & (ufo.City == "Arlington")].head(5)

            City Colors Reported Shape Reported State              Time
202    Arlington           GREEN           OVAL    VA   7/13/1952 21:00
6300   Arlington             NaN        CHEVRON    VA    5/5/1990 21:40
10278  Arlington             NaN           DISK    VA   5/27/1997 15:30
14527  Arlington             NaN          OTHER    VA   9/10/1999 21:41
17984  Arlington             RED           DISK    VA  11/19/2000 22:00

In [64]:
# Count the number of missing values in each column
ufo.isnull().sum()

City                  47
Colors Reported    63509
Shape Reported      8402
State                  0
Time                   0
dtype: int64

In [65]:
# Show only the UFO reports in which the City is missing
ufo[ufo.City.isnull()].head(5)

    City Colors Reported Shape Reported State             Time
21   NaN             NaN            NaN    LA   8/15/1943 0:00
22   NaN             NaN          LIGHT    LA   8/15/1943 0:00
204  NaN             NaN           DISK    CA  7/15/1952 12:30
241  NaN            BLUE           DISK    MT   7/4/1953 14:00
613  NaN             NaN           DISK    NV   7/1/1960 12:00

In [66]:
# How many rows remain if you drop all rows with any missing values?
ufo.dropna().count()

City               15510
Colors Reported    15510
Shape Reported     15510
State              15510
Time               15510
dtype: int64

In [67]:
# Bonus Create a new column called 'Location' that includes both City and State
ufo['Location'] = ufo.City + ", " + ufo.State
ufo.head(2)

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"

In [68]:
# Bonus Replace any spaces in the column names with an underscore
new_columns = ufo.columns.str.replace(' ', '_')
ufo.columns = new_columns
ufo.head()

,City,Colors_Reported,Shape_Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

We can perform operations on Data Frame subsets and then record only the result for each subset. Think about this as a [split-apply-combine](http://i.imgur.com/yjNkiwL.png) operation. Or perhaps you're familiar with the notion of "Group By".

In [71]:
# for each continent, calculate the mean beer servings
drinks.groupby('continent').beer.mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
NA    145.434783
OC     89.687500
SA    175.083333
Name: beer, dtype: float64

In [72]:
# for each continent, count the number of occurrences
drinks.continent.value_counts()

AF    53
EU    45
AS    44
NA    23
OC    16
SA    12
Name: continent, dtype: int64

In [74]:
# for each continent, describe beer servings
drinks.groupby('continent').beer.describe().head(5)

continent
AF         count    53.000000
           mean     61.471698
           std      80.557816
           min       0.000000
           25%      15.000000
dtype: float64

In [76]:
# similar, but outputs a DataFrame and can be customized
drinks.groupby('continent').beer.agg(['count', 'mean', 'min', 'max'])
drinks.groupby('continent').beer.agg(['count', 'mean', 'min', 'max']).sort_values('mean')

           count        mean  min  max
continent
AS            44   37.045455    0  247
AF            53   61.471698    0  376
OC            16   89.687500    0  306
NA            23  145.434783    1  285
SA            12  175.083333   93  333
EU            45  193.777778    0  361

In [77]:
# if you don't specify a column to which the aggregation function should be applied,
# it will be applied to all numeric columns
drinks.groupby('continent').mean()
#drinks.groupby('continent').describe()

                 beer      spirit        wine    liters
continent
AF          61.471698   16.339623   16.264151  3.007547
AS          37.045455   60.840909    9.068182  2.170455
EU         193.777778  132.555556  142.222222  8.617778
NA         145.434783  165.739130   24.521739  5.995652
OC          89.687500   58.437500   35.625000  3.381250
SA         175.083333  114.750000   62.416667  6.308333

** Exercise **

1. For each occupation in 'users', count the number of occurrences
2. For each occupation, calculate the mean age
3. **Bonus** For each occupation, calculate the minimum and maximum ages
4. **Bonus** For each combination of occupation and gender, calculate the mean age
5. Think about how obnoxious it would be to do all this stuff with a for loop.

In [78]:
# For each occupation in 'users', count the number of occurrences
users.occupation.value_counts().head(3)

student     196
other       105
educator     95
Name: occupation, dtype: int64

In [79]:
# For each occupation, calculate the mean age
users.groupby('occupation').age.mean().head(3)

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
Name: age, dtype: float64

In [80]:
# Bonus For each occupation, calculate the minimum and maximum ages
users.groupby('occupation').age.agg(['min','max']).head(3)

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64

In [81]:
# Bonus For each combination of occupation and gender, calculate the mean age
users.groupby(['occupation', 'gender']).age.mean().head(7)

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
Name: age, dtype: float64

Think about how obnoxious it would be to do all this stuff with a for loop

Also, note that we can select multiple columns or rows when we're going this kind of subsetting.

In [83]:
# select multiple columns
my_cols = ['City', 'State']     # create a list of column names...
ufo[my_cols]                    # ...and use that list to select columns
ufo[['City', 'State']].head(5)          # or, combine into a single step

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In [86]:
# use loc to select columns by name
ufo.loc[:, 'City']              # colon means "all rows", then select one column
ufo.loc[:, ['City', 'State']]   # select two columns
ufo.loc[:, 'City':'State'].head(5)      # select a range of columns

                   City Colors_Reported Shape_Reported State
0                Ithaca             NaN       TRIANGLE    NY
1           Willingboro             NaN          OTHER    NJ
2               Holyoke             NaN           OVAL    CO
3               Abilene             NaN           DISK    KS
4  New York Worlds Fair             NaN          LIGHT    NY

In [87]:
# loc can also filter rows by "name" (the index)
ufo.loc[0, :]                   # row 0, all columns
ufo.loc[0:2, :]                 # rows 0/1/2, all columns
ufo.loc[0:2, 'City':'State']    # rows 0/1/2, range of columns

          City Colors_Reported Shape_Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ
2      Holyoke             NaN           OVAL    CO

In [88]:
# use iloc to filter rows and select columns by integer position
ufo.iloc[:, [0, 3]]             # all rows, columns in position 0/3
ufo.iloc[:, 0:4]                # all rows, columns in position 0/1/2/3
ufo.iloc[0:3, :]                # rows in position 0/1/2, all columns

,City,Colors_Reported,Shape_Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"

Here's a grab-bag of other common Data Frame features that you'll commonly use.

In [89]:
# map existing values to a different set of values
users['is_male'] = users.gender.map({'F':0, 'M':1})

In [90]:
# encode strings as integer values (automatically starts at 0)
users['occupation_num'] = users.occupation.factorize()[0]

In [91]:
# determine unique values in a column
users.occupation.nunique()      # count the number of unique values
users.occupation.unique()       # return the unique values

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'], dtype=object)

In [92]:
# replace all instances of a value in a column (must match entire value)
ufo.State.replace('Fl', 'FL', inplace=True)

In [94]:
# string methods are accessed via 'str'
ufo.State.str.upper()                               # converts to uppercase
ufo.Colors_Reported.str.contains('RED', na='False').head(5) # checks for a substring

0    False
1    False
2    False
3    False
4    False
Name: Colors_Reported, dtype: object

In [100]:
# convert a string to the datetime format
ufo['Time'] = pd.to_datetime(ufo.Time)
ufo.Time.dt.hour                        # datetime format exposes convenient attributes
(ufo.Time.max() - ufo.Time.min()).days  # also allows you to do datetime "math"
ufo[ufo.Time > pd.datetime(2014, 1, 1)].head(5) # boolean filtering with datetime format

,Time,City,Colors_Reported,Shape_Reported,State,Location
75177,2014-01-01 00:01:00,Clarksville,ORANGE,SPHERE,TN,"Clarksville, TN"
75178,2014-01-01 00:01:00,Henderson,NaN,SPHERE,NV,"Henderson, NV"
75179,2014-01-01 00:01:00,Salem,RED YELLOW,LIGHT,OR,"Salem, OR"
75180,2014-01-01 00:01:00,Waxhaw,NaN,DISK,NC,"Waxhaw, NC"
75181,2014-01-01 00:02:00,El Paso,NaN,FORMATION,TX,"El Paso, TX"

In [101]:
# setting and then removing an index
ufo.set_index('Time', inplace=True)
ufo.reset_index(inplace=True)

In [102]:
# sort a column by its index
ufo.State.value_counts().sort_index().head(5)

AK      403
AL      808
AR      748
AZ     3019
CA    10743
Name: State, dtype: int64

In [104]:
# change the data type of a column
drinks['beer'] = drinks.beer.astype('float')

In [107]:
# change the data type of a column when reading in a file
pd.read_csv('../DAT-DC-10/data/drinks.csv', dtype={'beer':float}).head(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [108]:
# create dummy variables for 'continent' and exclude first dummy column
continent_dummies = pd.get_dummies(drinks.continent, prefix='cont').iloc[:, 1:]

In [109]:
# concatenate two DataFrames (axis=0 for rows, axis=1 for columns)
drinks = pd.concat([drinks, continent_dummies], axis=1)

Here's some less-frequently-used stuff that's good to know about.

In [110]:
# create a DataFrame from a dictionary
pd.DataFrame({'capital':['Montgomery', 'Juneau', 'Phoenix'], 'state':['AL', 'AK', 'AZ']})

      capital state
0  Montgomery    AL
1      Juneau    AK
2     Phoenix    AZ

In [111]:
# create a DataFrame from a list of lists
pd.DataFrame([['Montgomery', 'AL'], ['Juneau', 'AK'], ['Phoenix', 'AZ']], columns=['capital', 'state'])

      capital state
0  Montgomery    AL
1      Juneau    AK
2     Phoenix    AZ

In [112]:
# detecting duplicate rows
users.duplicated()          # True if a row is identical to a previous row
users.duplicated().sum()    # count of duplicates
users[users.duplicated()]   # only show duplicates
users.drop_duplicates()     # drop duplicate rows
users.age.duplicated()      # check a single column for duplicates
users.duplicated(['age', 'gender', 'zip_code']).sum()   # specify columns for finding duplicates

13

In [114]:
# display a cross-tabulation of two Series
pd.crosstab(users.occupation, users.gender).head(5)

gender          F   M
occupation
administrator  36  43
artist         13  15
doctor          0   7
educator       26  69
engineer        2  65

In [116]:
# alternative syntax for boolean filtering (noted as "experimental" in the documentation)
users.query('age < 20')                 # users[users.age < 20]
users.query("age < 20 and gender=='M'") # users[(users.age < 20) & (users.gender=='M')]
users.query('age < 20 or age > 60').head(5)     # users[(users.age < 20) | (users.age > 60)]

         age gender occupation zip_code  is_male  occupation_num
user_id
30         7      M    student    55436        1               5
36        19      F    student    93117        0               5
52        18      F    student    55105        0               5
57        16      M       none    84010        1              16
67        17      M    student    60402        1               5

In [117]:
# display the memory usage of a DataFrame
ufo.info()          # total usage
ufo.memory_usage()  # usage by column

<class 'pandas.core.frame.DataFrame'>
Int64Index: 80543 entries, 0 to 80542
Data columns (total 6 columns):
Time               80543 non-null datetime64[ns]
City               80496 non-null object
Colors_Reported    17034 non-null object
Shape_Reported     72141 non-null object
State              80543 non-null object
Location           80496 non-null object
dtypes: datetime64[ns](1), object(5)
memory usage: 4.3+ MB

Time               644344
City               644344
Colors_Reported    644344
Shape_Reported     644344
State              644344
Location           644344
dtype: int64

In [118]:
# change a Series to the 'category' data type (reduces memory usage and increases performance)
ufo['State'] = ufo.State.astype('category')

In [120]:
# temporarily define a new column as a function of existing columns
drinks.assign(servings = drinks.beer + drinks.spirit + drinks.wine).head(5)

,country,beer,spirit,wine,liters,continent,cont_AS,cont_EU,cont_NA,cont_OC,cont_SA,servings
0,Afghanistan,0,0,0,0.0,AS,1,0,0,0,0,0
1,Albania,89,132,54,4.9,EU,0,1,0,0,0,275
2,Algeria,25,0,14,0.7,AF,0,0,0,0,0,39
3,Andorra,245,138,312,12.4,EU,0,1,0,0,0,695
4,Angola,217,57,45,5.9,AF,0,0,0,0,0,319

In [123]:
# limit which rows are read when reading in a file
pd.read_csv('../DAT-DC-10/data/drinks.csv', nrows=10)           # only read first 10 rows
pd.read_csv('../DAT-DC-10/data/drinks.csv', skiprows=[1, 2]).head(5)    # skip the first two rows of data

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Algeria,25,0,14,0.7,AF
1,Andorra,245,138,312,12.4,EU
2,Angola,217,57,45,5.9,AF
3,Antigua & Barbuda,102,128,45,4.9,NaN
4,Argentina,193,25,221,8.3,SA

In [124]:
# write a DataFrame out to a CSV
drinks.to_csv('drinks_updated.csv')                 # index is used as first column
drinks.to_csv('drinks_updated.csv', index=False)    # ignore index

In [126]:
# save a DataFrame to disk (aka 'pickle') and read it from disk (aka 'unpickle')
drinks.to_pickle('drinks_pickle')
pd.read_pickle('drinks_pickle').head(5)

,country,beer,spirit,wine,liters,continent,cont_AS,cont_EU,cont_NA,cont_OC,cont_SA
0,Afghanistan,0,0,0,0.0,AS,1,0,0,0,0
1,Albania,89,132,54,4.9,EU,0,1,0,0,0
2,Algeria,25,0,14,0.7,AF,0,0,0,0,0
3,Andorra,245,138,312,12.4,EU,0,1,0,0,0
4,Angola,217,57,45,5.9,AF,0,0,0,0,0

In [127]:
# randomly sample a DataFrame
train = drinks.sample(frac=0.75, random_state=1)    # will contain 75% of the rows
test = drinks[~drinks.index.isin(train.index)]      # will contain the other 25%

In [129]:
# change the maximum number of rows and columns printed ('None' means unlimited)
pd.set_option('max_rows', None)     # default is 60 rows
pd.set_option('max_columns', None)  # default is 20 columns
print drinks.head(5)

       country  beer  spirit  wine  liters continent  cont_AS  cont_EU  \
0  Afghanistan     0       0     0     0.0        AS        1        0
1      Albania    89     132    54     4.9        EU        0        1
2      Algeria    25       0    14     0.7        AF        0        0
3      Andorra   245     138   312    12.4        EU        0        1
4       Angola   217      57    45     5.9        AF        0        0

   cont_NA  cont_OC  cont_SA
0        0        0        0
1        0        0        0
2        0        0        0
3        0        0        0
4        0        0        0

In [130]:
# reset options to defaults
pd.reset_option('max_rows')
pd.reset_option('max_columns')

That's a lot of litte odds-and-ends, but I hope you realize that the Data Frame idea is superbly useful will save us a lot of work.

In [132]:
import pandas as pd
#average number of toppings per burrito
orders = pd.read_table('../DAT-DC-10/data/chipotle.tsv', sep='\t', index_col="order_id")

In [133]:
orders.head()

,quantity,item_name,choice_description,item_price
order_id,,,,
1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,Izze,[Clementine],$3.39
1,1,Nantucket Nectar,[Apple],$3.39
1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [134]:
total_burritos = orders.item_name.str.contains('Burrito').sum()
total_burritos

1172

In [135]:
total_toppings = (orders[orders.item_name.str.contains('Burrito')].choice_description.str.count(',') + 1).sum()
total_toppings

6323

In [136]:
avg_toppings_per_burrito = float(total_toppings) / total_burritos
round(avg_toppings_per_burrito, 2)

5.4